# # YOLOv8-Lite: Lightweight Fire Detection Model
# # Optimized for single class detection (fire and smoke combined)
# # Target: ~1.5M parameters (vs YOLOv8n: 3.0M)

# nc: 1  # number of classes (1 = fire_smoke combined)

# # Backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [16, 3, 2]]          # 0-P1/2
#   - [-1, 1, Conv, [32, 3, 2]]          # 1-P2/4
#   - [-1, 1, C2f, [32, 1]]              # 2 - Fixed: removed True
#   - [-1, 1, Conv, [64, 3, 2]]          # 3-P3/8
#   - [-1, 1, C2f, [64, 1]]              # 4 - Single repeat for efficiency
#   - [-1, 1, Conv, [96, 3, 2]]          # 5-P4/16 (Reduced: 128 -> 96)
#   - [-1, 1, C2f, [96, 1]]              # 6
#   - [-1, 1, Conv, [128, 3, 2]]         # 7-P5/32 (Reduced: 256 -> 128)
#   - [-1, 1, C2f, [128, 1]]             # 8
#   - [-1, 1, SPPF, [128, 5]]            # 9 (Reduced: 256 -> 128)

# # Head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
#   - [[-1, 6], 1, Concat, [1]]                    # 11 cat backbone P4
#   - [-1, 1, C2f, [96, 1]]                        # 12 (Reduced: 128 -> 96)

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
#   - [[-1, 4], 1, Concat, [1]]                    # 14 cat backbone P3
#   - [-1, 1, C2f, [64, 1]]                        # 15 (P3/8-small)

#   - [-1, 1, Conv, [64, 3, 2]]                    # 16
#   - [[-1, 12], 1, Concat, [1]]                   # 17 cat head P4
#   - [-1, 1, C2f, [96, 1]]                        # 18 (P4/16-medium)

#   - [-1, 1, Conv, [96, 3, 2]]                    # 19
#   - [[-1, 9], 1, Concat, [1]]                    # 20 cat head P5
#   - [-1, 1, C2f, [128, 1]]                       # 21 (P5/32-large)

#   - [[15, 18, 21], 1, Detect, [nc]]              # 22 Detect(P3, P4, P5)



# YOLOv8n object detection model for fire detection (nc=1)
# Adapted from Ultralytics YOLOv8n

nc: 1  # number of classes (fire)

# YOLOv8n summary: 315 layers,  3157200 parameters,  3157088 gradients,   8.9 GFLOPs

scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                  # 1-P2/4
  - [-1, 3, C2f, [128, True]]                   # 2
  - [-1, 1, Conv, [256, 3, 2]]                  # 3-P3/8
  - [-1, 6, C2f, [256, True]]                   # 4
  - [-1, 1, Conv, [512, 3, 2]]                  # 5-P4/16
  - [-1, 6, C2f, [512, True]]                   # 6
  - [-1, 1, Conv, [512, 3, 2]]                  # 7-P5/32
  - [-1, 3, C2f, [512, True]]                   # 8
  - [-1, 1, SPPF, [512, 5]]                     # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]          # 10
  - [[-1, 6], 1, Concat, [1]]                         # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                               # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]          # 13
  - [[-1, 4], 1, Concat, [1]]                         # 14 cat backbone P3
  - [-1, 3, C2f, [256]]                               # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                        # 16
  - [[-1, 12], 1, Concat, [1]]                        # 17 cat head P4
  - [-1, 3, C2f, [512]]                               # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                        # 19
  - [[-1, 9], 1, Concat, [1]]                         # 20 cat head P5
  - [-1, 3, C2f, [1024]]                              # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]                   # Detect(P3, P4, P5)